In [1]:

import pandas as pd
array = [2, 4, 6, 8, 10, 12]

series_obj = pd.Series(array)

arr = series_obj.values
arr

array([ 2,  4,  6,  8, 10, 12], dtype=int64)

In [2]:
reshaped_arr = arr.reshape((3, 2))
reshaped_arr

array([[ 2,  4],
       [ 6,  8],
       [10, 12]], dtype=int64)

In [3]:

import pandas as pd

array = ["ankit","shaurya",
"shivangi", "priya",
"jeet","ananya"]
series_obj = pd.Series(array)
print("Given Series:\n", series_obj)

arr = series_obj.values
arr

Given Series:
 0       ankit
1     shaurya
2    shivangi
3       priya
4        jeet
5      ananya
dtype: object

array(['ankit', 'shaurya', 'shivangi', 'priya', 'jeet', 'ananya'],
      dtype=object)

In [4]:

reshaped_arr = arr.reshape((2, 3))
print("After Reshaping: \n", reshaped_arr)

After Reshaping:
 [['ankit' 'shaurya' 'shivangi']
 ['priya' 'jeet' 'ananya']]

In [5]:

import pandas as pd
df = pd.DataFrame({'A': ['John', 'Boby', 'Mina'],
'B': ['Masters', 'Graduate', 'Graduate'],
'C': [27, 23, 21]})
df

      A         B   C
0  John   Masters  27
1  Boby  Graduate  23
2  Mina  Graduate  21

In [7]:
df.pivot('A', 'B', 'C')

TypeError: DataFrame.pivot() takes 1 positional argument but 4 were given

In [8]:
df.pivot(index ='A', columns ='B', values =['C', 'A'])

            C                A
B    Graduate Masters Graduate Masters
A
Boby       23     NaN     Boby     NaN
John      NaN      27      NaN    John
Mina       21     NaN     Mina     NaN

In [10]:
import pandas as pd

df = pd.DataFrame({'Name': ['John', 'Sammy', 'Stephan', 'Joe', 'Emily', 'Tom'],
'Gender': ['Male', 'Female', 'Male',
'Female', 'Female', 'Male'],
'Age': [45, 6, 4, 36, 12, 43]})
print("Dataset")
print(df)
print("-"*40)
def age_bucket(age):
 if age <= 18:
  return "<18"
 else:
  return ">18"
df['Age Group'] = df['Age'].apply(age_bucket)

gender = pd.DataFrame(df.Gender.value_counts(normalize=True)*100).reset_index()
gender.columns = ['Gender', '%Gender']
df = pd.merge(left=df, right=gender, how='inner', on=['Gender'])
table = pd.pivot_table(df, index=['Gender', '%Gender', 'Age Group'],
values=['Name'], aggfunc={'Name': 'count',})
print("Table")
print(table)

Dataset
      Name  Gender  Age
0     John    Male   45
1    Sammy  Female    6
2  Stephan    Male    4
3      Joe  Female   36
4    Emily  Female   12
5      Tom    Male   43
----------------------------------------
Table
                          Name
Gender %Gender Age Group
Female 50.0    <18           2
               >18           1
Male   50.0    <18           1
               >18           2